# -*- coding: UTF-8 -*-
#python3 version
import time

arr = ("大安", "留连", "速喜", "赤口", "小吉","空亡")

print("注意:输入的日期为农历.")
print()
print()
y = input("月份:")
r = input("日期:")
print()
print()
print()
sh = time.strftime('%H',time.localtime(time.time()))
shi = int(sh)
if(shi>=1) and (shi<3):
    s = 2
elif(shi>=3 and shi<5):
    s = 3
elif(shi>=5 and shi<7):
    s = 4
elif(shi>=7 and shi<9):
    s = 5
elif(shi>=9 and shi<11):
    s = 6
elif(shi>=11 and shi<13):
    s = 7
elif(shi>=13 and shi<15):
    s = 8
elif(shi>=15 and shi<17):
    s = 9
elif(shi>=17 and shi<19):
    s = 10
elif(shi>=19 and shi<21):
    s = 11
elif(shi>=21 and shi<23):
    s = 12
else:
    s = 1

val = y + r + s - 3
check = val % 6

if (arr[check]=="大安"):
    print("大安：身不动时，五行属木，颜色青色，方位东方，临青龙，凡谋事主一、五、七。有静止、心安、吉祥之含义。")
    print("身不动时，属木，青龙，凡事主逢一、五、七")
    print("大安事事昌，求财在坤方，失物去不远，宅舍保安康，行人身未动，病者主无妨。将军回田野，仔细与推详，丢失在附近，可能西南向，安居得吉日，不可动身祥。办事别出屋，求借邀自房，得病凶化吉，久疾得安康，寻人知音信，可能归村庄。口舌能消散，远行要提防，交易别出村，离屯细推详，求财有八分，得全不出房。")
elif (arr[check]=="留连"):
    print("留连：卒未归时，五行属水，颜色黑色，方位北方，临玄武，凡谋事主二、八、十。有暗昧不明、延迟、纠缠、拖延、漫长之含义。")
    print("人未归时，属水，玄武，凡事主逢在二、八、十")
    print("留连事未当，求事日莫光，凡事只宜缓，去者未回向，失物南方去，急急行便访。紧记防口舌，人口且平祥，丢失难寻找，窃者又转场，出行定不归，久去拖延长。办事不果断，牵连又返往，求借不易成，被求而彷徨，此日患疾病，几天不复康。找人迷雾中，迷迷又恍惚，口舌继续有，拖拉又伸长，女方嫁吉日，求财六分量。")
elif (arr[check]=="速喜"):
    print("速喜：人即至时，五行属火，颜色红色，方位南方，临朱雀，凡谋事主三、六、九。有快速、喜庆、吉利之含义。指时机已到。")
    print("人便至时，属火，朱雀，凡事主在三，六，九")
    print("速喜喜临乡，求财往南方，失物申午未，逢人路寻详，官事有福德，病者无大伤。六畜田稼庆，行人有音向，丢失得音信，微乐在面上，出行遇吉利，小喜而顺当。办事如逢春，吉利又荣光，小量可求借，大事难全强，久病见小愈，得病速回康，寻人得知见，口舌见消亡，交易可得成，但不太久长，求财有十分，吉时得顺当。")
elif (arr[check]=="赤口"):
    print("赤口：官事凶时，五行属金，颜色白色，方位西方，临白虎，凡谋事主四、七、十。有不吉、惊恐、凶险、口舌是非之含义。")
    print("官事凶时，属金，白虎，凡事主在四、七，十")
    print("赤口主口伤，官事且紧防，失物急去找，行人有惊慌，鸡犬多作怪，病者上西方。更须防咒咀，恐怕染瘟殃，找物犯谎口，寻问无音向，出门千口怨，言谈万骂伤。办事犯口舌，难成有阻挡，求借不全顺，闭口无事张，得病千口猜，求医还无妨。寻人得凶音，人心不安详，口舌犯最重，交易口舌防，求财只四分，逢吉才成当。")
elif (arr[check]=="小吉"):
    print("小吉：人来喜时，五行属水，临六合，凡谋事主一、五、七。有和合、吉利之含义。")
    print("人来喜时，属水，六合，凡事主逢在一、五、七")
    print("小吉最吉昌，路上好商量，阴人来报喜，失物在坤方，行人立刻至，交易甚是强。凡事皆合好，病者保安康，大吉又大顺，万事如意详，出行可得喜，千里吉安详。诸事可心顺，有忧皆消光，求借自来助，众友愿相帮，重病莫要愁，久病得安康。不见得相见，不打自归庄，千人称赞君，无限上荣光，交易成兴隆，十二分财量。")
else:
    print("空亡：音信稀时，五行属土，颜色黄色，方位中央，临勾陈，凡谋事主三、六、九。有不吉、无结果、忧虑之含义。")
    print("音信稀时，属土，勾陈，凡事主在三、六、九")
    print("空亡事不长，阴人无主张，求财心白费，行人有灾殃，失物永不见，官事有刑伤。病人遇邪鬼，久病添祸殃，失物难找见，找寻空荡荡，出行不吉利，凶多不吉祥。办事凶为多，处处有阻挡，求借不能成，成事化败伤，得病凶多噩，久患雪加霜。寻人无音信，知音变空想，万口都诽骂，小舟遭狂浪，求财有二分，不吉不利亡。")
print()
print()
print()

raw_input("按Enter键退出")